<template>
    <div class="dialog" :class="showDialog ? 'dialog--active' : ''">
        <md-dialog-title>
            <a href="#" class="close-button" @click="closeDialog">
                &times;
            </a>
        </md-dialog-title>
        <div class="page-content-wrapper">
            <div class="container">
                <div class="privacy-policy-wrapper pb-3">
                    <h6>﻿Пользовательское Соглашение</h6>
                    <p>Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между ТСЖ Московский квартал (далее ТСЖ Московский квартал или Администрация) с одной стороны и Пользователем (членом ТСЖ Московский квартал) приложения с другой.<br>
                        Приложение ТСЖ Московский квартал не является средством массовой информации.</p>
                    <p>Используя приложение, Вы соглашаетесь с условиями данного соглашения.<br>
                        Если Вы не согласны с условиями данного соглашения, не используйте приложение ТСЖ Московский квартал!</p>
                    <h6>Предмет соглашения</h6>
                    <p>Администрация предоставляет пользователю право на размещение в приложении следующей информации:<br>
                        - Обращения<br>
                        Пользователь разрешает ТСЖ «Московский квартал» использование предоставленных персональных данных.</p>
                    <h6>Предмет соглашения</h6>
                    <p>Администрация предоставляет пользователю право на размещение в приложении следующей информации:<br>
                        - Текстовой информации<br>
                        - Фотоматериалов<br>
                        - Ссылок на материалы, размещенные на других приложениях</p>
                    <h6>Права и обязанности сторон</h6>
                    <p>Член ТСЖ Московский квартал имеет право:<br>
                        - осуществлять поиск информации в приложении<br>
                        - получать информацию в приложении<br>
                        - создавать информацию для приложения<br>
                        - комментировать контент, выложенный в приложении<br>
                        - использовать информацию приложения в личных некоммерческих целях<br>
                        - использовать информацию приложения в коммерческих целях с разрешения Администрации<br>
                        - использовать информацию приложения в коммерческих целях с разрешения правообладателей<br>
                        - использовать информацию приложения в коммерческих целях без специального разрешения</p>
                    <p>Перед использованием настоящего Приложения, Пользователь заявляет о желании вступить в ТСЖ «Московский квартал» в многоквартирном доме по адресу: г. СПб, ул. Варшавская, д. 6, к. 1, лит. А, подтверждая ознакомление с Уставом ТСЖ «Московский квартал» и обязанность выполнения указанного Устава и всех связанных документов.</p>
                    <p>Указанное заявление считается поданным и полученным Правлением ТСЖ «Московский квартал» при любом использовании данного приложения, при условии соблюдения норм ЖК РФ.</p>
                    <h6>Администрация имеет право:</h6>
                    <p>- по своему усмотрению и необходимости создавать, изменять, отменять правила<br>
                        - ограничивать доступ к любой информации в приложении<br>
                        - создавать, изменять, удалять информацию<br>
                        - удалять учетные записи<br>
                        - отказывать в регистрации без объяснения причин</p>
                    <h6>Пользователь обязуется:</h6>
                    <p>- обеспечивать сохранность личных данных от доступа третьих лиц<br>
                        - не нарушать работоспособность приложения<br>
                        - не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Приложением и его Сервисами</p>
                    <h6>Администрация обязуется:</h6>
                    <p>- поддерживать работоспособность приложения за исключением случаев, когда это невозможно по независящим от Администрации причинам.<br>
                        - осуществлять разностороннюю защиту учетной записи Пользователя<br>
                        - защищать информацию, распространение которой ограничено или запрещено законами путем вынесения предупреждения либо удалением учетной записи пользователя, нарушившего правила</p>
                    <h6>Ответственность сторон</h6>
                    <p>- пользователь лично несет полную ответственность за распространяемую им информацию<br>
                        - администрация не несет никакой ответственности за достоверность информации, скопированной из других источников<br>
                        - администрация не несет никакой ответственности за сбои в приложении технического характера<br>
                        - администрация не несёт ответственность за несовпадение ожидаемых Пользователем и реально полученных услуг<br>
                        - администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами<br>
                        - в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса</p>
                    <h6>Условия действия Соглашения</h6>
                    <p>Данное Соглашение вступает в силу при любом использовании данного приложения.<br>
                        Соглашение перестает действовать при появлении его новой версии.<br>
                        Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.<br>
                        Администрация не оповещает пользователей об изменении в Соглашении.</p>
                </div>
            </div>
        </div>
    </div>

    <!--<md-dialog :md-active="showDialog">
        <md-dialog-title>
            <a href="#" class="close-button" @click="closeDialog">
                &times;
            </a>
        </md-dialog-title>
        <div class="page-content-wrapper">
            <div class="container">
                &lt;!&ndash; Privacy Policy&ndash;&gt;
                <div class="privacy-policy-wrapper py-3">
                    <h6>﻿Пользовательское Соглашение</h6>
                    <p>Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между ТСЖ Московский квартал (далее ТСЖ Московский квартал или Администрация) с одной стороны и Пользователем (членом ТСЖ Московский квартал) приложения с другой.<br>
                        Приложение ТСЖ Московский квартал не является средством массовой информации.</p>
                    <p>Используя приложение, Вы соглашаетесь с условиями данного соглашения.<br>
                        Если Вы не согласны с условиями данного соглашения, не используйте приложение ТСЖ Московский квартал!</p>
                    <h6>Предмет соглашения</h6>
                    <p>Администрация предоставляет пользователю право на размещение в приложении следующей информации:<br>
                        - Обращения<br>
                        Пользователь разрешает ТСЖ «Московский квартал» использование предоставленных персональных данных.</p>
                    <h6>Предмет соглашения</h6>
                    <p>Администрация предоставляет пользователю право на размещение в приложении следующей информации:<br>
                        - Текстовой информации<br>
                        - Фотоматериалов<br>
                        - Ссылок на материалы, размещенные на других приложениях</p>
                    <h6>Права и обязанности сторон</h6>
                    <p>Член ТСЖ Московский квартал имеет право:<br>
                        - осуществлять поиск информации в приложении<br>
                        - получать информацию в приложении<br>
                        - создавать информацию для приложения<br>
                        - комментировать контент, выложенный в приложении<br>
                        - использовать информацию приложения в личных некоммерческих целях<br>
                        - использовать информацию приложения в коммерческих целях с разрешения Администрации<br>
                        - использовать информацию приложения в коммерческих целях с разрешения правообладателей<br>
                        - использовать информацию приложения в коммерческих целях без специального разрешения</p>
                    <p>Перед использованием настоящего Приложения, Пользователь заявляет о желании вступить в ТСЖ «Московский квартал» в многоквартирном доме по адресу: г. СПб, ул. Варшавская, д. 6, к. 1, лит. А, подтверждая ознакомление с Уставом ТСЖ «Московский квартал» и обязанность выполнения указанного Устава и всех связанных документов.</p>
                    <p>Указанное заявление считается поданным и полученным Правлением ТСЖ «Московский квартал» при любом использовании данного приложения, при условии соблюдения норм ЖК РФ.</p>
                    <h6>Администрация имеет право:</h6>
                    <p>- по своему усмотрению и необходимости создавать, изменять, отменять правила<br>
                        - ограничивать доступ к любой информации в приложении<br>
                        - создавать, изменять, удалять информацию<br>
                        - удалять учетные записи<br>
                        - отказывать в регистрации без объяснения причин</p>
                    <h6>Пользователь обязуется:</h6>
                    <p>- обеспечивать сохранность личных данных от доступа третьих лиц<br>
                        - не нарушать работоспособность приложения<br>
                        - не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Приложением и его Сервисами</p>
                    <h6>Администрация обязуется:</h6>
                    <p>- поддерживать работоспособность приложения за исключением случаев, когда это невозможно по независящим от Администрации причинам.<br>
                        - осуществлять разностороннюю защиту учетной записи Пользователя<br>
                        - защищать информацию, распространение которой ограничено или запрещено законами путем вынесения предупреждения либо удалением учетной записи пользователя, нарушившего правила</p>
                    <h6>Ответственность сторон</h6>
                    <p>- пользователь лично несет полную ответственность за распространяемую им информацию<br>
                        - администрация не несет никакой ответственности за достоверность информации, скопированной из других источников<br>
                        - администрация не несет никакой ответственности за сбои в приложении технического характера<br>
                        - администрация не несёт ответственность за несовпадение ожидаемых Пользователем и реально полученных услуг<br>
                        - администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами<br>
                        - в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса</p>
                    <h6>Условия действия Соглашения</h6>
                    <p>Данное Соглашение вступает в силу при любом использовании данного приложения.<br>
                        Соглашение перестает действовать при появлении его новой версии.<br>
                        Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.<br>
                        Администрация не оповещает пользователей об изменении в Соглашении.</p>
                </div>
            </div>
        </div>
    </md-dialog>-->
</template>

<script>
    export default {
        data: () => ({}),
        methods: {
            closeDialog() {
                this.$emit('close')
            }
        },
        computed: {},
        props: ['showDialog']
    }
</script>

<style scoped>
    .md-dialog {
        overflow: auto;
    }

    .page-content-wrapper {
        overflow: auto;
        margin: 0;
    }

    .md-dialog-title {
        background-color: #000!important;
        margin-bottom: 0!important;
        display: flex;
        align-items: center;
        padding: 15px 15px;
    }

    .close-button {
        color: #fff!important;
        font-size: 2em;
        text-decoration: none;
    }

    a:active {
        text-decoration: none!important;
    }

    .dialog {
        height: 100vh;
        width: 100vw;
        position: fixed;
        bottom: -100vh;
        left: 0;
        background: #fff;
        z-index: 999;
        -webkit-transition-duration: 400ms;
        -o-transition-duration: 400ms;
        transition-duration: 400ms;
        overflow-y: scroll;
    }

    .dialog--active {
        bottom: 0;
    }
</style>